
## Plan Result

[CI link](https://github.com/hikobend/aws-sample-architecture-ecs/actions/runs/5839242052)


<pre><code>Plan: 5 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.ecs.aws_iam_policy.ecs_exec_policy
  * module.ecs.aws_iam_role.execution_role
  * module.ecs.aws_iam_role.task_role
  * module.ecs.aws_iam_role_policy_attachment.execution_attachement
  * module.ecs.aws_iam_role_policy_attachment.task_attachement


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.ecs.aws_iam_policy.ecs_exec_policy will be created
  + resource "aws_iam_policy" "ecs_exec_policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "AmazonECSExecPolicy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "ssmmessages:OpenDataChannel",
                          + "ssmmessages:OpenControlChannel",
                          + "ssmmessages:CreateDataChannel",
                          + "ssmmessages:CreateControlChannel",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = {
          + "Environment" = "dev"
        }
    }

  # module.ecs.aws_iam_role.execution_role will be created
  + resource "aws_iam_role" "execution_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nginx-execution-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs.aws_iam_role.task_role will be created
  + resource "aws_iam_role" "task_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ecs-tasks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "nginx-task-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "dev"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.ecs.aws_iam_role_policy_attachment.execution_attachement will be created
  + resource "aws_iam_role_policy_attachment" "execution_attachement" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy"
      + role       = "nginx-execution-role"
    }

  # module.ecs.aws_iam_role_policy_attachment.task_attachement will be created
  + resource "aws_iam_role_policy_attachment" "task_attachement" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "nginx-task-role"
    }

Plan: 5 to add, 0 to change, 0 to destroy.
```

</details>



## :warning: Warnings :warning:

```hcl
Warning: Argument is deprecated

  with module.network.module.network.aws_eip.nat,
  on .terraform/modules/network.network/main.tf line 1030, in resource "aws_eip" "nat":
1030:   vpc = true

use domain attribute instead

(and 2 more similar warnings elsewhere)

```



<!-- github-comment: {"Command":"plan","JobName":"terraform_plan","PRNumber":45,"Program":"tfcmt","SHA1":"10b190a41774ad1ba89282d40e290255530776cf","Vars":{},"WorkflowName":"dev plan"} -->